toasterllc/MDCCode/Code/STM32/Shared/USBBase.h
    // Accessors
    State state() const {
        IRQState irq = IRQState::Disabled();
        return _state;
    }
    
    // Methods
    void connect() {
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connecting) return; // Short-circuit if we're not Connecting
        
        // Open endpoints
        for (uint8_t ep : {Endpoints...}) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _device.ep_out[EndpointIdx(ep)].is_used = 1U;
                // Reset endpoint state
                _outEndpoint(ep) = {};
            
            } else {
                USBD_LL_OpenEP(&_device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _device.ep_in[EndpointIdx(ep)].is_used = 1U;
                // Reset endpoint state
                _inEndpoint(ep) = {};
            }
        }
        
        _cmd = std::nullopt;
        _state = State::Connected;
    }
    
    void endpointReset(uint8_t ep) {
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return; // Short-circuit if we're not Connected
        
        if (EndpointOut(ep)) {
            _OutEndpoint& outep = _outEndpoint(ep);
            if (_ready(outep))  _endpointReset(ep, outep);
            else                outep.needsReset = true;
        
        } else {
            _InEndpoint& inep = _inEndpoint(ep);
            if (_ready(inep))   _endpointReset(ep, inep);
            else                inep.needsReset = true;
        }
    }
    
    bool endpointReady(uint8_t ep) {
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return false; // Short-circuit if we're not Connected
        
        if (EndpointOut(ep))    return _ready(_outEndpoint(ep));
        else                    return _ready(_inEndpoint(ep));
    }
    
    std::optional<Cmd> cmdRecv() {
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        return _cmd;
    }
    
    void cmdAccept(bool accept) {
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return; // Short-circuit if we're not Connected
        
        if (accept) USBD_CtlSendStatus(&_device);
        else        USBD_CtlError(&_device, nullptr);
        
        _cmd = std::nullopt;
    }
    
    void recv(uint8_t ep, void* data, size_t len) {
        AssertArg(EndpointOut(ep));
        
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return; // Short-circuit if we're not Connected
        
        _OutEndpoint& outep = _outEndpoint(ep);
        Assert(_ready(outep));
        _advanceState(ep, outep);
        
        USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_device, ep, (uint8_t*)data, len);
        Assert(us == USBD_OK);
    }
    
    size_t recvLen(uint8_t ep) const {
        AssertArg(EndpointOut(ep));
        
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return 0; // Short-circuit if we're not Connected
        return _recvLen(_outEndpoint(ep));
    }
    
    void send(uint8_t ep, const void* data, size_t len) {
        AssertArg(EndpointIn(ep));
        
        IRQState irq = IRQState::Disabled();
        if (_state != State::Connected) return; // Short-circuit if we're not Connected
        
        _InEndpoint& inep = _inEndpoint(ep);
        Assert(_ready(inep));
        _advanceState(ep, inep);
        
        USBD_StatusTypeDef us = USBD_LL_Transmit(&_device, ep, (uint8_t*)data, len);
        Assert(us == USBD_OK);
    }
    
protected:
    void _isr() {
        ISR_HAL_PCD(&_pcd);
    }
    
    void _deinit() {
//        USBD_StatusTypeDef us = USBD_Init(&_device, &HS_Desc, DEVICE_HS, this);
//        Assert(us == USBD_OK);
//        
//        HAL_StatusTypeDef hs = HAL_PCD_Init(&_pcd);
//        Assert(hs == HAL_OK);
//        
//#define Fwd0(name) [](USBD_HandleTypeDef* pdev) { return ((T*)pdev->pCtx)->_usbd_##name(); }
//#define Fwd1(name, T0) [](USBD_HandleTypeDef* pdev, T0 t0) { return ((T*)pdev->pCtx)->_usbd_##name(t0); }
//#define Fwd2(name, T0, T1) [](USBD_HandleTypeDef* pdev, T0 t0, T1 t1) { return ((T*)pdev->pCtx)->_usbd_##name(t0, t1); }
//        
//        static const USBD_ClassTypeDef usbClass = {
//            .Init                           = Fwd1(Init, uint8_t),
//            .DeInit                         = Fwd1(DeInit, uint8_t),
//            .Setup                          = Fwd1(Setup, USBD_SetupReqTypedef*),
//            .EP0_TxSent                     = Fwd0(EP0_TxSent),
//            .EP0_RxReady                    = Fwd0(EP0_RxReady),
//            .DataIn                         = Fwd1(DataIn, uint8_t),
//            .DataOut                        = Fwd1(DataOut, uint8_t),
//            .SOF                            = Fwd0(SOF),
//            .IsoINIncomplete                = Fwd1(IsoINIncomplete, uint8_t),
//            .IsoOUTIncomplete               = Fwd1(IsoOUTIncomplete, uint8_t),
//            .GetHSConfigDescriptor          = Fwd1(GetHSConfigDescriptor, uint16_t*),
//            .GetFSConfigDescriptor          = Fwd1(GetFSConfigDescriptor, uint16_t*),
//            .GetOtherSpeedConfigDescriptor  = Fwd1(GetOtherSpeedConfigDescriptor, uint16_t*),
//            .GetDeviceQualifierDescriptor   = Fwd1(GetDeviceQualifierDescriptor, uint16_t*),
//            .GetUsrStrDescriptor            = Fwd2(GetUsrStrDescriptor, uint8_t, uint16_t*),
//        };
//        
//#undef Fwd0
//#undef Fwd1
//#undef Fwd2
//        
//        us = USBD_RegisterClass(&_device, &usbClass);
//        Assert(us == USBD_OK);
//        
//        us = USBD_Start(&_device);
//        Assert(us == USBD_OK);
    }
    
    uint8_t _usbd_Init(uint8_t cfgidx) {
        _state = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_DeInit(uint8_t cfgidx) {
        _state = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
