toasterllc/MDCCode/Code/STM32/Shared/USBBase.h
    uint8_t _usbd_Setup(USBD_SetupReqTypedef* req) {
        switch (req->bmRequest & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_VENDOR:
            USBD_CtlPrepareRx(&_device, _cmdRecvBuf, sizeof(_cmdRecvBuf));
            return USBD_OK;
        
        default:
            USBD_CtlError(&_device, req);
            return USBD_FAIL;
        }
    }
    
    uint8_t _usbd_EP0_TxSent() {
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_EP0_RxReady() {
        const size_t dataLen = USBD_LL_GetRxDataSize(&_device, 0);
        if (!_cmd) {
            _cmd = Cmd{
                .data = _cmdRecvBuf,
                .len = dataLen,
            };
        } else {
            // If a command is already underway, respond to the request with an error
            USBD_CtlError(&_device, nullptr);
        }
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_DataIn(uint8_t ep) {
        // Sanity-check the endpoint state
        _InEndpoint& inep = _inEndpoint(ep);
        Assert(
            inep.state == _EndpointState::ResetZLP1     ||
            inep.state == _EndpointState::ResetZLP2     ||
            inep.state == _EndpointState::ResetZLP3     ||
            inep.state == _EndpointState::ResetSentinel ||
            inep.state == _EndpointState::Busy
        );
        
        _advanceState(ep, inep);
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_DataOut(uint8_t ep) {
        // Sanity-check the endpoint state
        _OutEndpoint& outep = _outEndpoint(ep);
        Assert(
            outep.state == _EndpointState::ResetZLP1     ||
            outep.state == _EndpointState::ResetZLP2     ||
            outep.state == _EndpointState::ResetSentinel ||
            outep.state == _EndpointState::Busy
        );
        
        _advanceState(ep, outep);
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_SOF() {
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_IsoINIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    uint8_t _usbd_IsoOUTIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    uint8_t* _usbd_GetHSConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    uint8_t* _usbd_GetFSConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    uint8_t* _usbd_GetOtherSpeedConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    uint8_t* _usbd_GetDeviceQualifierDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    uint8_t* _usbd_GetUsrStrDescriptor(uint8_t index, uint16_t* len) {
        return nullptr;
    }

private:
    _OutEndpoint& _outEndpoint(uint8_t ep) {
        if constexpr (EndpointCountOut()) {
            return _outEndpoints[EndpointIdx(ep)-1];
        }
        abort();
    }
    
    const _OutEndpoint& _outEndpoint(uint8_t ep) const {
        if constexpr (EndpointCountOut()) {
            return _outEndpoints[EndpointIdx(ep)-1];
        }
        abort();
//        return const_cast<const _OutEndpoint&>(std::as_const(*this)._outEndpoint(ep));
    }
    
    _InEndpoint& _inEndpoint(uint8_t ep) {
        if constexpr (EndpointCountIn()) {
            return _inEndpoints[EndpointIdx(ep)-1];
        }
        abort();
    }
    
    const _InEndpoint& _inEndpoint(uint8_t ep) const {
        if constexpr (EndpointCountIn()) {
            return _inEndpoints[EndpointIdx(ep)-1];
        }
        abort();
//        return const_cast<const _InEndpoint&>(std::as_const(*this)._inEndpoint(ep));
    }
    
    // Interrupts must be disabled
    bool _ready(const _OutEndpoint& outep)      const { return outep.state==_EndpointState::Ready;  }
    // Interrupts must be disabled
    bool _ready(const _InEndpoint& inep)        const { return inep.state==_EndpointState::Ready;   }
    
    size_t _recvLen(const _OutEndpoint& outep)  const { return outep.len;                           }
    
    // Interrupts must be disabled
    template <typename OutInEndpoint>
    void _endpointReset(uint8_t ep, OutInEndpoint& outinep) {
        outinep.state = _EndpointState::Reset;
        outinep.needsReset = false;
        _advanceState(ep, outinep);
    }
    
    // Interrupts must be disabled
    void _advanceState(uint8_t ep, _OutEndpoint& outep) {
        if (outep.needsReset) {
            _endpointReset(ep, outep);
            return;
        }
        
        outep.len = USBD_LL_GetRxDataSize(&_device, ep);
        
        // State transitions
        switch (outep.state) {
        case _EndpointState::Ready:
            outep.state = _EndpointState::Busy;
            break;
        case _EndpointState::Busy:
            outep.state = _EndpointState::Ready;
            break;
        case _EndpointState::Reset:
            outep.state = _EndpointState::ResetZLP1;
            break;
        case _EndpointState::ResetZLP1:
            // Only advance if we received a ZLP
            if (outep.len == 0) outep.state = _EndpointState::ResetSentinel;
            break;
        case _EndpointState::ResetSentinel:
            // Only advance if we received the sentinel
            if (outep.len == sizeof(_ResetSentinel)) outep.state = _EndpointState::Ready;
            break;
        default:
            abort();
        }
        
        // State actions
        switch (outep.state) {
        case _EndpointState::ResetZLP1:
        case _EndpointState::ResetSentinel:
            USBD_LL_PrepareReceive(&_device, ep, (uint8_t*)_DevNullAddr, MaxPacketSizeBulk);
            break;
        default:
            break;
        }
    }
    
    // Interrupts must be disabled
    void _advanceState(uint8_t ep, _InEndpoint& inep) {
        if (inep.needsReset) {
            _endpointReset(ep, inep);
            return;
        }
        
        // We send two ZLPs (instead of just one) because if a transfer is in progress, the first ZLP will
        // get 'eaten' as a ZLP that terminates the existing transfer. So to guarantee that the reader
        // actually gets a ZLP, we have to send two.
        // After sending the two ZLPs, we also send a sentinel to account for the fact that we don't know
        // how many ZLPs that the reader will receive, because we don't know if the first ZLP will
        // necessarily terminate a transfer (because a transfer may not have been in progress, or if a
        // transfer was in progress, it may have sent exactly the number of bytes that the reader
        // requested, in which case no ZLP is needed to end the transfer). By using a sentinel, the
        // reader knows that no further ZLPs will be received after the sentinel has been received, and
        // therefore the endpoint is finished being reset.
        
