toasterllc/MDCCode/Code/STM32/Shared/USBBase.h
        // State transitions
        switch (inep.state) {
        case _EndpointState::Ready:         inep.state = _EndpointState::Busy;          break;
        case _EndpointState::Busy:          inep.state = _EndpointState::Ready;         break;
        case _EndpointState::Reset:         inep.state = _EndpointState::ResetZLP1;     break;
        case _EndpointState::ResetZLP1:     inep.state = _EndpointState::ResetZLP2;     break;
        case _EndpointState::ResetZLP2:     inep.state = _EndpointState::ResetZLP3;     break;
        case _EndpointState::ResetZLP3:     inep.state = _EndpointState::ResetSentinel; break;
        case _EndpointState::ResetSentinel: inep.state = _EndpointState::Ready;         break;
        default:                            abort();
        }
        
        // State actions
        switch (inep.state) {
        case _EndpointState::ResetZLP1:
        case _EndpointState::ResetZLP2:
        case _EndpointState::ResetZLP3:
            USBD_LL_TransmitZeroLen(&_device, ep);
            break;
        case _EndpointState::ResetSentinel:
            USBD_LL_Transmit(&_device, ep, (uint8_t*)&_ResetSentinel, sizeof(_ResetSentinel));
            break;
        default:
            break;
        }
    }
    
    friend void ISR_OTG_HS();
    
protected:
    USBD_HandleTypeDef _device;
    
private:
    alignas(4) static const inline uint8_t _ResetSentinel = 0;
    
    // _DevNullAddr: address that throw-away data can be written to.
    // This must be a region that a packet can be written to without causing
    // side-effects. We don't want to reserve actual RAM for this because it'd
    // just be wasted.
    // We're currently using the flash base address, so that the writes will be
    // ignored as long as the flash isn't unlocked.
    static constexpr uint32_t _DevNullAddr = 0x08000000;
    
    std::optional<Cmd> _cmd;
    alignas(4) uint8_t _cmdRecvBuf[MaxPacketSizeCtrl];
    _OutEndpoint _outEndpoints[EndpointCountOut()] = {};
    _InEndpoint _inEndpoints[EndpointCountIn()] = {};
    PCD_HandleTypeDef _pcd;
    State _state = State::Disconnected;
};
